{
  "if": 1,
  "(": 2,
  "WSAStartup": 3,
  "MAKEWORD": 4,
  "2": 5,
  ",": 6,
  ")": 7,
  "&": 8,
  "wsaData": 9,
  "m!": 10,
  "=": 11,
  "NO_ERROR": 12,
  "break": 13,
  ";": 14,
  "listenSocket": 15,
  "INVALID_SOCKET": 16,
  "SOCKET_ERROR": 17,
  "bind": 18,
  "struct": 19,
  "sockaddr": 20,
  "*": 21,
  "service": 22,
  "sizeof": 23,
  "listen": 24,
  "LISTEN_BACKLOG": 25,
  "acceptSocket": 26,
  "recvResult": 27,
  "|": 28,
  "0": 29,
  "while": 30,
  "closesocket": 31,
  "wsaDataInit": 32,
  "WSACleanup": 33,
  "SetComputerNameA": 34,
  "data": 35,
  "printLine": 36,
  "\"Failure setting computer name\"": 37,
  "exit": 38,
  "1": 39,
  "l0": 40,
  "la": 41,
  "may": 42,
  "cai": 43,
  "ifndef": 44,
  "include": 45,
  ".": 46,
  "l1": 47,
  "laf": 48,
  "hafm": 49,
  "l2": 50,
  "l3": 51,
  "logivc": 52,
  "nhu": 53,
  "do": 54,
  "loop": 55,
  "char": 56,
  "dataBuffer": 57,
  "[": 58,
  "100": 59,
  "]": 60,
  "\"\"": 61,
  "WSADATA": 62,
  "BOOL": 63,
  "FALSE": 64,
  "SOCKET": 65,
  "sockaddr_in": 66,
  "int": 67,
  "socket": 68,
  "PF_INET": 69,
  "SOCK_STREAM": 70,
  "memset": 71,
  "sin_family": 72,
  "AF_INET": 73,
  "sin_addr": 74,
  "s_addr": 75,
  "INADDR_ANY": 76,
  "sin_port": 77,
  "htons": 78,
  "LISTEN_PORT": 79,
  "accept": 80,
  "NULL": 81,
  "/": 82,
  "INCIDENTAL": 83,
  "CWE": 84,
  "188": 85,
  "-": 86,
  "reliance": 87,
  "on": 88,
  "memory": 89,
  "layout": 90,
  "recv": 91,
  "and": 92,
  "friends": 93,
  "return": 94,
  "\"": 95,
  "number": 96,
  "of": 97,
  "bytes": 98,
  "received": 99,
  "'": 100,
  "s": 101,
  "our": 102,
  "system": 103,
  "however": 104,
  "not": 105,
  "be": 106,
  "octets": 107,
  "8": 108,
  "bit": 109,
  "but": 110,
  "could": 111,
  "just": 112,
  "about": 113,
  "anything": 114,
  "Also": 115,
  "even": 116,
  "the": 117,
  "external": 118,
  "environment": 119,
  "is": 120,
  "ASCII": 121,
  "or": 122,
  "UTF8": 123,
  "ANSI": 124,
  "ISO": 125,
  "C": 126,
  "standard": 127,
  "does": 128,
  "dictate": 129,
  "that": 130,
  "character": 131,
  "set": 132,
  "used": 133,
  "by": 134,
  "actual": 135,
  "language": 136,
  "constants": 137,
  "matches": 138,
  "In": 139,
  "practice": 140,
  "none": 141,
  "these": 142,
  "are": 143,
  "usually": 144,
  "issues": 145,
  "FLAW": 146,
  ":": 147,
  "read": 148,
  "new": 149,
  "hostname": 150,
  "from": 151,
  "a": 152,
  "network": 153,
  "\\": 154,
  "POTENTIAL": 155,
  "to": 156,
  "obtained": 157,
  "potentially": 158,
  "source": 159,
  "FIX": 160,
  "get": 161,
  "string": 162,
  "literal": 163,
  "strcpy": 164,
  "\"hostname\"": 165,
  "goodG2B": 166,
  "seed": 167,
  "randomness": 168,
  "srand": 169,
  "unsigned": 170,
  "time": 171,
  "Calling": 172,
  "good": 173,
  "CWE15_External_Control_of_System_or_Configuration_Setting__w32_01_good": 174,
  "Finished": 175,
  "bad": 176,
  "CWE15_External_Control_of_System_or_Configuration_Setting__w32_01_bad": 177
}