{
  "batch_info": {
    "processed_at": "2025-10-23T05:47:54.803326",
    "note": "Global vocabulary extracted from all processed files."
  },
  "statistics": {
    "total_files": 2,
    "processed_files": 2,
    "vocabulary_size": 94
  },
  "vocabulary": {
    "<PAD>": 1,
    "<UNK>": 2,
    "<START>": 3,
    "<END>": 4,
    "#": 5,
    "include": 6,
    "\"std_testcase.h\"": 7,
    "ifdef": 8,
    "_WIN32": 9,
    "define": 10,
    "BASEPATH": 11,
    "\"c:\\\\temp\\\\\"": 12,
    "else": 13,
    "<": 14,
    "wchar": 15,
    ".": 16,
    "h": 17,
    ">": 18,
    "\"/tmp/\"": 19,
    "endif": 20,
    "winsock2": 21,
    "windows": 22,
    "direct": 23,
    "pragma": 24,
    "comment": 25,
    "(": 26,
    "lib": 27,
    ",": 28,
    "\"ws2_32\"": 29,
    ")": 30,
    "CLOSE_SOCKET": 31,
    "closesocket": 32,
    "sys": 33,
    "/": 34,
    "types": 35,
    "socket": 36,
    "netinet": 37,
    "in": 38,
    "arpa": 39,
    "inet": 40,
    "unistd": 41,
    "INVALID_SOCKET": 42,
    "-": 43,
    "1": 44,
    "SOCKET_ERROR": 45,
    "close": 46,
    "SOCKET": 47,
    "int": 48,
    "TCP_PORT": 49,
    "27015": 50,
    "IP_ADDRESS": 51,
    "\"127.0.0.1\"": 52,
    "FOPEN": 53,
    "fopen": 54,
    "namespace": 55,
    "CWE23_Relative_Path_Traversal__char_connect_socket_fopen_01": 56,
    "{": 57,
    "ifndef": 58,
    "OMITBAD": 59,
    "void": 60,
    "bad": 61,
    "char": 62,
    "*": 63,
    "data": 64,
    ";": 65,
    "dataBuffer": 66,
    "[": 67,
    "FILENAME_MAX": 68,
    "]": 69,
    "=": 70,
    "WSADATA": 71,
    "wsaData": 72,
    "wsaDataInit": 73,
    "0": 74,
    "recvResult": 75,
    "struct": 76,
    "sockaddr_in": 77,
    "service": 78,
    "replace": 79,
    "connectSocket": 80,
    "size_t": 81,
    "dataLen": 82,
    "strlen": 83,
    "do": 84,
    "if": 85,
    "WSAStartup": 86,
    "MAKEWORD": 87,
    "2": 88,
    "&": 89,
    "!=": 90,
    "NO_ERROR": 91,
    "break": 92,
    "}": 93,
    "CWE23_Relative_Path_Traversal__char_connect_socket_fopen_02": 94
  }
}